import { Category } from './Categories';

const infoServices: Category[] = [
  {
    title: 'ДЕРЖАВНА РЕЄСТРАЦІЯ',
    id: 'state-registration',
    description: [
      {
        heading: 'РЕЄСТРАЦІЯ ЮРИДИЧНОЇ ОСОБИ',
        description:
          ' Процес оформлення створення нової юридичної особи відповідно до законодавства. Це може включати в себе заснування компанії, громадської організації або іншого юридичного об`єкта.',
      },
      {
        heading: 'ПРАВА НА НЕРУХОМЕ МАЙНО',
        description:
          'Правові принципи та норми, що регулюють відносини, пов`язані з володінням, користуванням та розпорядженням нерухомості. Це може включати в себе власність на землю, будівлі, квартири та інші форми нерухомого майна.',
      },
      {
        heading: 'ЗМІНА ДАНИХ ЮРИДИЧНОЇ ОСОБИ',
        description:
          'Процес оновлення інформації про юридичну особу, який може включати зміну назви, адреси, директора, статутного капіталу або інших відомостей, зареєстрованих в органах державної влади.',
      },
      {
        heading: 'ФІЗИЧНОЇ ОСОБИ (ФОП)',
        description:
          'Фізична особа-підприємець (ФОП в Україні) - це індивідуальний підприємець, який веде господарську діяльність без створення юридичної особи.',
      },
      {
        heading: 'ЗМІНА ДАНИХ ФІЗИЧНОЇ ОСОБИ',
        description:
          'Процес оновлення особистої інформації про фізичну особу, яка може включати зміну імені, адреси, контактних даних, громадянства або іншої інформації, зареєстрованої в органах державної влади.',
      },
    ],
  },
  {
    title: 'ДОВІРЕНОСТІ',
    id: 'trust',
    description: [
      {
        heading: 'ПРЕДСТАВНИЦТВО ІНТЕРЕСІВ',
        description:
          'Діяльність, спрямована на захист прав і законних інтересів індивідуальних осіб або юридичних осіб.',
      },
      {
        heading: 'КЕРУВАННЯ АВТОМОБІЛЕМ',
        description:
          'Вміння водія керувати транспортним засобом, включаючи знання правил дорожнього руху та здатність відповідати на дорожні ситуації.',
      },
      {
        heading: 'КЕРУВАННЯ РАХУНКОМ',
        description:
          'Управління фінансами, включаючи відкриття, закриття та здійснення транзакцій за допомогою банківського рахунку.',
      },
      {
        heading: 'ДЕРЖРЕЄСТРАЦІЯ',
        description:
          'Офіційна процедура реєстрації в державному реєстрі, що може стосуватися нерухомості, транспортних засобів, юридичних осіб тощо.',
      },
      {
        heading: 'ВІДКРИТТЯ РАХУНКУ',
        description:
          'Процедура створення нового банківського рахунку для особистого або корпоративного використання.',
      },
    ],
  },
  {
    title: 'ДОГОВОРИ',
    id: 'contracts',
    description: [
      {
        heading: 'КУПІВЛІ-ПРОДАЖУ',
        description:
          'Легальна транзакція між двома сторонами, при якій одна сторона купує товар або послугу, а інша сторона їх продает.',
      },
      {
        heading: 'ДОЖИТНОГО УТРИМАННЯ',
        description:
          "Угода, за якою одна особа зобов'язується утримувати іншу особу протягом всього її життя.",
      },
      {
        heading: 'УГОДА ПРО РОЗПОДІЛ МАЙНА',
        description:
          'Документ, що визначає, як буде розподілено майно між двома або більше сторонами.',
      },
      {
        heading: 'ДАРУНОК',
        description:
          'Предмет, який безоплатно передається однією особою іншій без очікування винагороди.',
      },
      {
        heading: 'ДОГОВІР ІПОТЕКИ',
        description:
          'Правовий документ, що встановлює іпотечний кредит, забезпечений нерухомістю.',
      },
    ],
  },
  {
    title: 'ЗАЯВИ',
    id: 'applications',
    description: [
      {
        heading: 'ЗГОДА СУПРУГИ',
        description:
          'Формальне погодження одного з подружжя на певні дії, як-то продаж майна, іпотека тощо.',
      },
      {
        heading: 'ОФОРМЛЕННЯ ЗАКОРДОННОГО ПАСПОРТА',
        description:
          'Процедура отримання документа, що підтверджує особистість і громадянство, та дає змогу подорожувати за кордон.',
      },
      {
        heading: 'ОТРИМАННЯ ДУБЛІКАТІВ',
        description:
          'Процес видачі копії оригінального документа, що може бути потрібний у випадку його втрати або пошкодження.',
      },
      {
        heading: 'ВИЇЗД ДИТИНИ ЗА КОРДОН',
        description:
          'Процедура, що дозволяє дитині виїхати за кордон, зазвичай вимагає погодження обох батьків або офіційного дозволу.',
      },
      {
        heading: 'ГАРАНТІЯ ОПЛАТИ ПОЇЗДКИ',
        description:
          "Документ, що засвідчує здатність особи або організації виконати фінансові зобов'язання щодо певної подорожі.",
      },
    ],
  },
  {
    title: 'ВИТЯГИ',
    id: 'extracts',
    description: [
      {
        heading: 'ДЕРЖАВНИЙ РЕЄСТР',
        description:
          'Офіційний список, що ведеться державним органом, який може містити різну інформацію, зокрема про нерухомість, транспортні засоби, громадян та юридичних осіб.',
      },
      {
        heading: 'РЕЄСТР ОБТЯЖЕНЬ',
        description:
          'Офіційний запис всіх правових обмежень, які стосуються власності, таких як іпотеки або застави.',
      },
      {
        heading: 'РУХОМЕ МАЙНО',
        description:
          'Майно, яке можна фізично переміщувати, наприклад, меблі, транспортні засоби, обладнання тощо.',
      },
      {
        heading: 'РЕЄСТР ДОВІРЕНОСТЕЙ',
        description:
          'Офіційний список усіх довіреностей, виданих конкретною особою або організацією.',
      },
      {
        heading: 'ОБТЯЖЕННЯ НЕРУХОМОСТІ',
        description:
          "Правові обмеження або зобов'язання, що стосуються власності на нерухомість.",
      },
    ],
  },
  {
    title: 'СПАДКОВІ СПРАВИ',
    id: 'inheritance',
    description: [
      {
        heading: 'ВІДКРИТТЯ СПАДКОВОЇ СПРАВИ',
        description:
          'Процедура, що розпочинає офіційний процес передачі майна від померлого до спадкоємців.',
      },
      {
        heading: 'ПРАВО НА СПАДЩИНУ',
        description:
          'Законне право особи на отримання майна від померлого, згідно з законом або заповітом.',
      },
      {
        heading: 'ВНЕСЕННЯ ДО РЕЄСТРУ',
        description:
          'Дія, що передбачає додавання інформації до офіційного документа або бази даних, наприклад реєстра.',
      },
      {
        heading: 'ВЕДЕННЯ СПАДКОВОЇ СПРАВИ',
        description:
          'Процес адміністрування спадкового майна, який може включати ідентифікацію майна, виплату боргів та розподіл майна між спадкоємцями.',
      },
      {
        heading: 'ОФОРМЛЕННЯ ЗАПОВІТІВ',
        description:
          'Процес створення документа, який визначає, як майно особи буде розподілене після її смерті.',
      },
    ],
  },
  {
    title: 'ПІДТВЕРДЖЕННЯ, СВІДЕЦТВУВАННЯ',
    id: 'verification',
    description: [
      {
        heading: 'ПІДТВЕРДЖЕННЯ ПІДПИСУ',
        description:
          'Процедура, що підтверджує, що певний підпис належить конкретній особі.',
      },
      {
        heading: 'ПІДЛИННІСТЬ ПІДПИСУ',
        description:
          'Перевірка того, що підпис є оригінальним і був зроблений відповідною особою.',
      },
      {
        heading: 'КУПІВЛЯ МАЙНА З АУКЦІОНУ',
        description:
          'Процес придбання товарів або послуг через аукціон, де виграє найвища ставка.',
      },
      {
        heading: 'ПІДПИС ПЕРЕКЛАДАЧА',
        description:
          'Підпис перекладача на документі, що свідчить про те, що переклад вірний і точний.',
      },
      {
        heading: 'ПІДТВЕРДЖЕННЯ КОПІЇ',
        description:
          'Процедура, яка засвідчує, що копія документа є точною копією оригіналу.',
      },
    ],
  },
  {
    title: 'ПІДТВЕРДЖЕННЯ ФАКТІВ',
    id: 'confirmation-facts',
    description: [
      {
        heading: 'ПІДТВЕРДЖЕННЯ ОСОБИ',
        description:
          'Процедура встановлення особи особи на основі певних доказів або документів.',
      },
      {
        heading: 'ПЕРЕБУВАННЯ В ПЕВНОМУ МІСЦІ',
        description:
          'Визначення присутності особи в певному місці в певний час, що може бути визначено за допомогою документів, свідків або технологій.',
      },
      {
        heading: 'ЧАС ПОДАННЯ ДОКУМЕНТА',
        description:
          'Точний момент подачі документа, який може бути важливим для дотримання певних юридичних термінів або процедур.',
      },
      {
        heading: 'ПЕРЕБУВАННЯ В ЖИВИХ',
        description:
          "Доказ того, що особа жива на певний момент часу. Це може бути засвідчено різними способами, включаючи, але не обмежуючись, особистою виставою, свідченням свідків, відео- або аудіозв'язком.",
      },
      {
        heading: 'ПЕРЕДАЧА ЗАЯВИ',
        description:
          'Процес надання офіційного заявлення або документа відповідній особі або організації.',
      },
    ],
  },
];

export async function GET() {
  return new Response(JSON.stringify(infoServices), {
    status: 200,
    headers: {
      'content-type': 'application/json',
    },
  });
}
