const infoServices = [
  {
    title: 'ДЕРЖАВНА РЕЄСТРАЦІЯ',
    id: 'registration',
    description: [
      'РЕЄСТРАЦІЯ ЮРИДИЧНОЇ ОСОБИ',
      'ПРАВА НА НЕРУХОМЕ МАЙНО',
      'ЗМІНА ДАНИХ ЮРИДИЧНОЇ ОСОБИ',
      'ФІЗИЧНОЇ ОСОБИ (ФЛП, ФОП)',
      'ЗМІНА ДАНИХ ФІЗИЧНОЇ ОСОБИ',
    ],
  },
  {
    title: 'ДОВІРЕНОСТІ',
    id: 'trust',
    description: [
      'ПРЕДСТАВНИЦТВО ІНТЕРЕСІВ',
      'КЕРУВАННЯ АВТОМОБІЛЕМ',
      'КЕРУВАННЯ РАХУНКОМ',
      'ДЕРЖРЕЄСТРАЦІЯ',
      'ВІДКРИТТЯ РАХУНКУ',
    ],
  },
  {
    title: 'ДОГОВОРИ',
    id: 'contracts',
    description: [
      'КУПІВЛІ-ПРОДАЖУ',
      'ДОЖИТНОГО УТРИМАННЯ',
      'УГОДА ПРО РОЗПОДІЛ МАЙНА',
      'ДАРУНОК',
      'ДОГОВІР ІПОТЕКИ',
    ],
  },
  {
    title: 'ЗАЯВИ',
    id: 'applications',
    description: [
      'ЗГОДА СУПРУГИ',
      'ОФОРМЛЕННЯ ЗАКОРДОННОГО ПАСПОРТА',
      'ОТРИМАННЯ ДУБЛІКАТІВ',
      'ВИЇЗД ДИТИНИ ЗА КОРДОН',
      'ГАРАНТІЯ ОПЛАТИ ПОЇЗДКИ',
    ],
  },
  {
    title: 'ВИТЯГИ',
    id: 'extracts',
    description: [
      'ДЕРЖАВНИЙ РЕЄСТР',
      'РЕЄСТР ОБТЯЖЕНЬ',
      'РУХОМЕ МАЙНО',
      'РЕЄСТР ДОВІРЕНОСТЕЙ',
      'ОБТЯЖЕННЯ НЕРУХОМОСТІ',
    ],
  },
  {
    title: 'СПАДКОВІ СПРАВИ',
    id: 'inheritance',
    description: [
      'ВІДКРИТТЯ СПАДКОВОЇ СПРАВИ',
      'ПРАВО НА СПАДЩИНУ',
      'ВНЕСЕННЯ ДО РЕЄСТРУ',
      'ВЕДЕННЯ СПАДКОВОЇ СПРАВИ',
      'ОФОРМЛЕННЯ ЗАПОВІТІВ',
    ],
  },
  {
    title: 'ПІДТВЕРДЖЕННЯ,СВІДЕЦТВУВАННЯ',
    id: 'confirmation',
    description: [
      'ПІДТВЕРДЖЕННЯ ПІДПИСУ',
      'ПІДЛИННІСТЬ ПІДПИСУ',
      'КУПІВЛЯ МАЙНА З АУКЦІОНУ',
      'ПІДПИС ПЕРЕКЛАДАЧА',
      'ПІДТВЕРДЖЕННЯ КОПІЇ',
    ],
  },
  {
    title: 'ПІДТВЕРДЖЕННЯ ФАКТІВ',
    id: 'confirmation-facts',
    description: [
      'ПІДТВЕРДЖЕННЯ ОСОБИ',
      'ПЕРЕБУВАННЯ В ПЕВНОМУ МІСЦІ',
      'ЧАС ПОДАННЯ ДОКУМЕНТА',
      'ПЕРЕБУВАННЯ В ЖИВИХ',
      'ПЕРЕДАЧА ЗАЯВИ',
    ],
  },
];
